{"N0.":1,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Adenanthera%20pavonina%20L.jpg?raw=true","Name":["海紅豆","Aandal Beadtree","Adenanthera pavonina L."],"familyGenus":"Fabaceae, Adenanthera","partUsed":"seeds","harvestProcessing":"Harvested mature legume in autumn; taken out the seeds and sun-dried.","propertiesActions":"Little bitter, pungent, little cold. Mild-toxic.Dispelling wind and clearing heat, relieving dampness and itching, moistening the skin and improving complexion.","indicationsUsage":"Dark spots on face, microsporosis versicolor, head and face urticaria, acne, brandy nose. External application: appropriate amount, applied in powdered form.<br>Toxic, usually not taken orally."}
{"N0.":2,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Glochidion%20puberum%20(L.)%20Hutch.jpg?raw=true","Name":["算盤子","Abacus Plant","Glochidion puberum (L.) Hutch."],"familyGenus":"Euphorbiaceae, Glochidion","partUsed":"fruits, roots and leaves","harvestProcessing":"Fruit: collected in autumn, removed foreign matters, and sun-dried.<br>Roots: collected throughout the year, removed foreign matters, sun-dried or used fresh.<br>Leaves: collected in summer and autumn, sun-dried or used fresh.","propertiesActions":"Fruit: bitter, cool., mild-toxic; clearing heat, inducing urination, activating blood and detoxifying.<br>Leaves: Bitter harsh, cool; clearing heat, inducing urination, dispersing swelling and detoxifying.<br>Root: bitter, cool; clearing heat, inducing urination, activating qi-flow, activating blood, dispersing swelling and detoxifying.","indicationsUsage":"Fruits: swelling pain of the throat, malaria, acute gastroenteritis, dyspepsia, dysentery, leukorrhea, hernia pain, stranguria with turbid urine, postpartum abdominalgia, toothache, and jaundice. Typically used for oral administration as a decoction, at a dosage of 9-15 grams.<br>Root: cold and pyrexia, cough, hygropyretic diarrhea and dysentery, malaria, jaundice, rheumatic arthralgia, whitish and turbid urine, leukorrhea, laryngalgia, toothache, anthracia, and various skin diseases or infections. Bitting of snakes and insects. For usage, Typically used for oral administration as a decoction, at a dosage of 15-30 grams. For External application, prepared decoction for fumigating and washing. NOT use during pregnancy.<br>Leaves: jaundice, hygropyretic diarrhea and dysentery, stranguria with turbid urine, leukorrhea, pyrexia, swelling pain of the throat, eczema, anthracia, furunculosis, and bites by snakes and insects. Used for oral administration as a decoction, with a dosage of 6-9 grams, or as fresh herb in amounts of 30-60 grams. Can also be dried, powdered, or used as extracted juice. For external use, a prepared decoction can be applied for fumigating and washing, Not use during pregnancy."}
{"N0.":3,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Abelmoschus%20manihot%20(L.)%20Medic..jpg?raw=true","Name":["黃蜀葵","Abelmoschus manihot","Abelmoschus manihot (L.) Medic."],"familyGenus":"Malvaceae, Abelmoschus","partUsed":"flowers, seeds, leaves, stem or stem bark and roots","harvestProcessing":"Flowers: Batch picking buds apart from reserving seed in July-October and sun-dried.<br>Seeds: harvested when fruits mature in Sept to Nov sun-dried and thresh, removed impurities then totally sun-dried.<br>Leaves: harvested in spring and summer, used fresh or sun-dried.<br>Stem or stem bark: harvested in autumn and Winter; sun-dried or fire-dried.<br>Roots: excavated in autumn, washed and sun-dried.","propertiesActions":"Flowers: Sweet, pungent, cool; urination and treats stranguria, activates blood circulation and arrests bleeding, reduces swelling and detoxifies.<br>Seeds: Sweet, cold; Excretes water, stimulates menstrual discharge, reduces swelling, and detoxifies.<br>Leaves: Sweet, cold; Eliminates heat and detoxifies, sets fractures, and promotes tissue regeneration.<br>Stem or Stem Bark: Sweet, cold; Removes heat and detoxifies, reduces defecation or urination.<br>Root: Sweet, bitter, cold; Excretes water, stimulates menstrual discharge, and detoxifies.","indicationsUsage":"Flower: stranguria, hematemesis, non-traumatic hemorrhage, metrorrhagia, metrostaxis, retention of afterbirth, anthracia, ulcers, and burns caused by hot liquids or fire. Orally administered as a decoction at a dosage of 5-15 grams or in powdered form at 3-6 grams. For external application, an appropriate amount can be powdered and coated with oil for topical use.<br>Seeds: stranguria, edema, constipation, infrequent lactation, anthracia, and injuries from falls. Taken orally as a decoction, with a dosage of 10-15 grams, or in powdered form at 2-5 grams. For external application, an appropriate amount can be smashed and applied directly.<br>Leaves: toxic heat, ulcerative carbuncle, urinary tract infections, fractures, burns, and trauma. Orally administered as a decoction at a dosage of 10-15 grams, or fresh products can be used in amounts of 30-50 grams. For external use, Coated with oil before application.<br>Stem or Stem Bark: pyrexia, constipation, difficulty in urination, furunculosis, swelling, and scalding injuries. Generally used in a similar manner as the other parts for both internal and external treatment.<br>Roots: stranguria, edema, constipation, injuries from falls, infrequent lactation, anthracia, cerumen, and parotitis. For oral administration, it is typically decocted at a dosage of 9-15 grams or smashed at 1.5-3 grams each time. For external application, an appropriate amount can be smashed or ground for topical use, or it can be decocted for washing."}
{"N0.":4,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Acalypha%20australis%20L..jpg?raw=true","Name":["鐵莧菜","Acalypha","Acalypha australis L."],"familyGenus":"Euphorbiaceae, Acalypha","partUsed":"whole plant","harvestProcessing":"Harvested in May–July, removed soil, sun-dried or used fresh.","propertiesActions":"Bitter, harsh, cool.Clearing fever and damp, cooling blood and detoxifying and relieving distention.","indicationsUsage":"Dysentery, diarrhea, hematemesis, non-traumatic hemorrhage, hematuria, hemafecia, metrorrhagia and metrostaxis, malnutritional stagnation in infants, furuncle and ulcer and skin eczema.Oral administration: decocting, 10-15g; Fresh products: 30-60g. External application: appropriate amount, or boiled in water, and wash, or applied in smashed pattern."}
{"N0.":5,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Angelica%20acutiloba%20(Siebold%20et%20Zucc.)%20Kitag.jpg?raw=true","Name":["日本當歸","Acutilobate Angelica","Angelica acutiloba (Siebold et Zucc.) Kitag."],"familyGenus":"Apiaceae, Angelica","partUsed":"roots","harvestProcessing":"Collected in autumn, removed the foreign matters, heat by low fire indoor, then dried.","propertiesActions":"Pungent, sweet, warm in nature.Enriching blood, activating blood circulation, stimulating menstrual flow, relieving pain, moistening dryness, and lubricating intestine.","indicationsUsage":"Syndrome of blood deficiency, irregular menstrual periods, algomenorrhea, menostasia, postpartum abdominalgia, constipation induced by dryness of the intestine.Internal: decocting, 10-30g."}
{"N0.":6,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Dioscorea%20bulbifera%20L..jpg?raw=true","Name":["黃獨","Air Potato","Dioscorea bulbifera L."],"familyGenus":"Dioscoreaceae, Dioscorea","partUsed":"tuber and puce bulbil in axil","harvestProcessing":"Tuber: excavated Hungyaozi after 2-3years of planting, taken those over 3cm, wash off sediment, cut off fibril, transect into 1cm-long pieces, sun-dried or dried over fire, or used fresh.<br>Bulbel: harvested in later summer and early autumn, used fresh or sliced, and sun-dried.","propertiesActions":"Tuber: bitter, cold, mild-toxic; dissipating binds-goiter, clearing heat-toxin, cooling blood and relieving hemorrhage.<br>Bulbel: bitter, pungent, cold, mild-toxic; clearing heat for dissipating phlegm, suppressing cough and asthma, dissipating binds and detoxifying.","indicationsUsage":"Tuber: goiter and tumor, anthracia and sores, venomous snake bites, tumor, hematemesis, non-traumatic hemorrhage, empsyxis, whooping cough, coughing with lung heat. Oral administration: decocting, 3-9g; or made as medicinal liquor; powdered, 1-2g. External application: appropriate amount, fresh products smashed for application; or powdered for application; or smashed to extract juice.<br>Bulbet: coughing with lung heat, whooping cough, swelling pain in the throat, goiter and tumor, scrofula, pyocutaneous disease and swelling, bites by snakes and dogs. Oral administration: decocting, 6-15g; or smashed to extract juice, made as medicinal liquor. External application: appropriate amount, sliced for pasting or smashed for application."}
{"N0.":7,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Bryophyllum%20pinnatum%20(L.f)%20Oken.jpg?raw=true","Name":["落地生根","Air-plant","Bryophyllum pinnatum (L.f) Oken"],"familyGenus":"Crassulaceae, Bryophyllum","partUsed":"root and entire plant","harvestProcessing":"Collected all over the year and used fresh.","propertiesActions":"Bitter, sour, cold.Cooling blood, arresting bleeding, clearing heat and detoxifying.","indicationsUsage":"Hematemesis, traumatic hemorrhage, injuries caused by falls, anthracia and furunculosis, mammary abscess, mammary carcinoma, erysipelas, ulcer, scalding injuries, gastralgia, arthralgia, swelling and pain in throat, cough with lung heat.Internal: decocting, fresh entire plant 30-0g; or extracted juice. External: appropriate amount, triturated for application; or extracted juice, sundried, and powdered; or gargle with extracted juice. Use with care in case of deficiency-cold of spleen and stomach."}
{"N0.":8,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Sedum%20aizoon%20L..jpg?raw=true","Name":["景天三七","Aizoon Stonecrop","Sedum aizoon L."],"familyGenus":"Crassulaceae, Sedum","partUsed":"root or entire plant","harvestProcessing":"Excavated root in spring and autumn, well washed, and sun-dried. Entire plant can be collected any time in need, or collected in autumn, and sun-dried.","propertiesActions":"Sweet, little sour, neutral.Dispersing stasis, arresting bleeding, inducing sedation and detoxifying.","indicationsUsage":"Hematemesis, non-traumatic hemorrhage, empsyxis, hemafecia, hematuria, metrorrhagia and metrostaxis, suggillation, hemorrhage caused by trauma, injuries from falls, palpitation, insomnia, anthracia and furunculosis, scalding and burns, bites by toxic insects.Oral administration: decocting, 15-30g; or extracted juice from fresh material, 30-60g. External application: appropriate amount, fresh herb triturated for application; or powdered and scattered on affected part. Not use in case of deficiency-cold of spleen and stomach."}
{"N0.":9,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Calotropis%20gigantea%20(L.)%20Dryand.%20ex%20W.%20T.%20Aiton.jpg?raw=true","Name":["牛角瓜","Akund Calotrope","Calotropis gigantea (L.) Dryand. ex W. T. Aiton"],"familyGenus":"Asclepiadaceae, Calotropis","partUsed":"leaf","harvestProcessing":"Collected in summer and autumn and sun-dried.","propertiesActions":"Little bitter, harsh, neutral.Toxic. Removing phlegm and stopping cough.","indicationsUsage":"Cough with asthma, excessive phlegm, whooping cough.Internal: decocting, 1-3g, or powdered."}
{"N0.":10,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Geum%20aleppicum%20Jacq..jpg?raw=true","Name":["水楊梅","Aleppo Avens","Geum aleppicum Jacq."],"familyGenus":"Rosaceae, Geum","partUsed":"entire plant or roots","harvestProcessing":"Collected in summer, used fresh or cut into segments and sundried.","propertiesActions":"Bitter, pungent, little cold.Clearing heat, detoxifying, activating blood, relieving pain, regulating menstruation and reducing leukorrhea.","indicationsUsage":"Anthracia and swelling pain, sore mouth and pharyngalgia, injury pain from fall, Rheumatic arthralgia, abdominal pain due to dysentery, irregular menstrual period, metrorrhagia and metrostaxia, beriberi and edema, infantile frightened epilepsy.Oral administration: decocting, 10-15g; powdered 1-1.5g. External application: appropriate amount, triturated for application; or prepared decoction for washing."}
{"N0.":11,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Alternanthera%20philoxeroides%20(Mart.)%20Griseb..jpg?raw=true","Name":["空心蓮子草","Alligator-weed","Alternanthera philoxeroides (Mart.) Griseb."],"familyGenus":"Amaranthaceae, Alternanthera","partUsed":"whole plant","harvestProcessing":"Collected in spring, summer, autumn, removed weeds, well washed, used fresh or sundried.","propertiesActions":"Bitter, sweet, cold.Clearing heat and cooling blood, detoxicating and disinhibiting urine.","indicationsUsage":"Coughing up blood, hematuria, cold and pyrexia, measles, encephalitis B, stranguria with turbid urine, eczema, anthracia and furunculosis, venomous snake bite.Oral administration: decocting, 30-60g, fresh products double in amount; or smashed to extract juice. External application: appropriate amount, smashed for application; or smashed to extract juice."}
{"N0.":12,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Rheum%20altaicum%20A.%20Los..jpg?raw=true","Name":["阿爾泰大黃","Altai Rhubarb","Rheum altaicum A. Los."],"familyGenus":"Polygonaceae, Rheum","partUsed":"roots and rhizome","harvestProcessing":"Excavated rhizome and roots in autumn, removed earth, sliced, sun-dried or used fresh.","propertiesActions":"Bitter, pungent, cool.Clearing heat-toxin, relieving hemorrhage, dispelling stasis and freeing bowel.","indicationsUsage":"Used for constipation induced by sthenic fever, empsyxis due to pulmonary tuberculosis, parotitis, anthracia, furuncle and swelling toxicity.Oral administration: decocting, 3-12g. External application: appropriate amount."}
{"N0.":13,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Alysicarpus%20vaginalis%20(L.)%20DC..jpg?raw=true","Name":["鏈莢豆","Alyce Clover","Alysicarpus vaginalis (L.) DC."],"familyGenus":"Fabaceae, Alysicarpus","partUsed":"whole plant","harvestProcessing":"Collected in summer, autumn well washed, used fresh, or sundried.","propertiesActions":"Taste sweet, bitter, and cool in nature.Promoting blood circulation and freeing meridians, setting a fracture and detumescence and clearing heat-toxin.","indicationsUsage":"Used for injuries caused by falls and fractures, aching pain of bones and muscles, traumatic hemorrhage, ulcerated pyocutaneous lesions not adducted consistently, parotitis, chronic hepatitis. Oral administration: decocting, 30-60g. External application: appropriate amount, fresh leaves smashed for application; or fresh whole plant, decocted for washing; Leaves powdered for dusting."}
{"N0.":14,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Panax%20quinquefolium%20L..jpg?raw=true","Name":["西洋參","America Ginseng","Panax quinquefolium L."],"familyGenus":"Araliaceae, Panax","partUsed":"roots","harvestProcessing":"Excavated in autumn, washed, sun-dried or low-temperature dried.","propertiesActions":"Sweet, little bitter, cools. Sweet, little bitter, cools.Tonifying qi and yin, clearing heat and engendering fluid.","indicationsUsage":"Used for deficiency of vital energy and yin-fluid, calor internus, coughing with asthma, bloody phlegm, thirst and fatigue due to asthenic fever, diabetes, dry mouth and pharynx.Oral administration: decocting (or decocting juice alone), 3-6g; or made as pills or powders. Unsuitable for using with black false hellebore. Not use in case of yang deficiency of spleen, cold-dampness blocked inside and damp-heat syndrome."}
{"N0.":15,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Phytolacca%20americana%20L..jpg?raw=true","Name":["垂序商陸","American Pokeweed","Phytolacca americana L"],"familyGenus":"Phytolaccaceae, Phytolacca","partUsed":"roots","harvestProcessing":"Can be harvested in autumn, winter or spring, removed stem leaves, fibril and earth, washed, cut into lump, sun-dried or dried in the shade.","propertiesActions":"Bitter, cold, toxic, Dispelling phlegm, calming panting, settling cough, antibiosis, anti-inflammatory and disinhibiting urine.","indicationsUsage":"Edema, tumescence, beriberi, pharyngitis, anthracia, ulcer.Oral administration: decocting, 7.5-15g; or made as powders. External application: smashed for applying."}
{"N0.":16,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Chenopodium%20ambrosioides%20L..jpg?raw=true","Name":["土荊芥","American Wormseed","Chenopodium ambrosioides L."],"familyGenus":"Chenopodiaceae, Chenopodium","partUsed":"whole plant with cluster","harvestProcessing":"Harvested whole plant in late Aug to late Sept., spread out and keep in open air, or bundled and hung up for drying in the shade, in case of sunshine and rain.","propertiesActions":"Pungent, bitter, little cold, very toxic.Disperse wind, dispersing dampness, killing worms stopping itching, quickening the blood and dispersing swelling.","indicationsUsage":"    Uncinariasis, ascariasis, enterobiasis, Pediculus humanus capitis, skin eczema, sarcoptidosis, rheumatic arthralgia, menostasia, algomenorrhea, mouth and tongue ulcers, swelling and pain in throat, injuries from falls, bites by snakes and insects.Oral administration: decocting, 3-9g, fresh products 15-24g, or made as pills or powders or extracted Tujinjie oil. For adults 0.8-1.2 ml (maximum 1.5 ml) per day; for children, 0.05 ml per year old. External application: appropriate amount, decocted for washing or smashed for application."}
{"N0.":17,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Berberis%20amurensis%20Rupr..jpg?raw=true","Name":["黃蘆木","Amur Barberry","Berberis amurensis Rupr."],"familyGenus":"Berberidaceae, Berberis","partUsed":"roots, stem and branchlet","harvestProcessing":"Excavated root and stem in spring and autumn, well washed and sun-dried.","propertiesActions":"Bitter, cold.Clearing heat, drying dampness and detoxifying.","indicationsUsage":"Enteritis, dysentery, acute and chronic hepatitis, chronic cholecystitis, unknown pyogenic infections, erysipelas and eczema, conjunctival congestion, sore mouth, scalding injuries.Internal: decocting, 5-20g. External: appropriate amount, powdered for dusting or application; prepared decoction for washing, or eye drippings."}
{"N0.":18,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Phellodendron%20amurense%20Rupr..jpg?raw=true","Name":["黃檗","Amur Corktree","Phellodendron amurense Rupr."],"familyGenus":"Rutaceae, Phellodendron","partUsed":"bark","harvestProcessing":"Picked off the bark, removed raw bark, and sun-dried.","propertiesActions":"Bitter, cold.Clearing heat, drying dampness, clearing heat, detoxifying and curing sore.","indicationsUsage":"Used for dysentery due to damp-heat pathogen, jaundice, leukorrhea, pyretic stranguria, beriberi, osteopyrexia, night sweat, emissions, pyocutaneous disease and swelling, eczema and pruritus.Oral administration: decocting, 3-12g; or made as pills or powders. External application: appropriate amount, powdered for application, or prepared decoction for washing. Not use in case of deficiency-cold of spleen and stomach."}
{"N0.":19,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Vitis%20amurensis%20Rupr..jpg?raw=true","Name":["山葡萄","Amur Grape","Vitis amurensis Rupr."],"familyGenus":"Vitaceae, Vitis","partUsed":"roots or vane and fruits","harvestProcessing":"Root or vane: harvested in autumn and winter, washed, cut into pieces or segments, and sun-dried.<br>Fruits: collected from Aug-Sept when fruits mature, used fresh or sundried.","propertiesActions":"Root or stem vine: Pungent, cool; dispelling pathogenic wind for suppressing pains. Fruits: sour, cool; clearing heat for disinhibiting urine.","indicationsUsage":"Root or stem vine: rheumatic ostalgia, gastralgia, stomachache, nervous headache, postoperational pain, traumatic pain.<br>Fruits: feverish dysphoria and hydrodipsia, urinary tract infection, difficulty in micturition.Roots or vane: oral administration: decocting, 3-9g. Fruits: oral administration: decocting, 10-15g."}
{"N0.":20,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Anemarrhena%20asphodeloides%20Bge..jpg?raw=true","Name":["知母","Anemarrhena","Anemarrhena asphodeloides Bge."],"familyGenus":"Liliaceae, Anemarrhena","partUsed":"roots","harvestProcessing":"Excavated in spring and autumn, better in autumn. Harvested three years after cultivating. Excavated rhizome, removed fine roots and fibrous roots, keep yellow tomentum and light yellow leaf scars and stem scars, sun-dried to produce \"Mao Zhimu\"(Hairy Common Anemarrhena Rhizome). When fresh, scraped corkbark and sun-dried to produce \"Guang Zhimu\"(Glabrous Common Anemarrhena Rhizome).","propertiesActions":"Bitter, cold.Nourishing Yin and reducing fire, moistening dryness and lubricating intestine.","indicationsUsage":"Feverish dysphoria and diabetes, osteopyrexia, cough with lung heat, constipation, difficulty in urination.Internal: decocting, 10-25g; or made as pills or powders. Do not use if deficient cold of spleen and stomach or loose stool."}
{"N0.":21,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Clematis%20montana%20Buch.%20Ham.%20ex%20DC..jpg?raw=true","Name":["綉球藤","Anemone Clematis","Clematis montana Buch. Ham. ex DC."],"familyGenus":"Ranunculaceae, Clematis","partUsed":"vines","harvestProcessing":"Excavated in autumn, scraped outer coat, sliced, and sun-dried.","propertiesActions":"Tasteless little bitter, cold, mild-toxic.Clearing heat for disinhibiting urine, freeing the network vessels and promoting lactaction.","indicationsUsage":"Edema, difficulty in micturition, stranguria and urodynia due to damp-heat in lower-JIAO.Oral administration: decocting, Chuanmutong 3-6g. Not use in cases of pregnancies, or those with weak qi and body fluid impairment, spermatorrhea or enuresis diuresis."}
{"N0.":22,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Angelica%20sinensis%20(Oliv.)%20Diels..jpg?raw=true","Name":["當歸","Angelica","Angelica sinensis (Oliv.) Diels."],"familyGenus":"Apiaceae, Angelica","partUsed":"roots","harvestProcessing":"Collected at the end of autumn, removed the foreign matters, steamed, sun-dried or dried in low temperature.","propertiesActions":"Sweet, pungent, warm.Enriching blood, activating blood circulation, stimulating menstrual flow, relieving pain, lubricating intestine, and relaxing bowel.","indicationsUsage":"Used for chlorosis due to hemopenia, vertigo and palpitation, irregular menstrual periods, amenorrhea and algomenorrhea, asthenia cold abdominalgia, constipation induced by dryness of the intestine, rheumatic arthralgia, injuries from falls, superficial infection and pyocutaneous disease.Internal: decocting, 7.5-15g; made as medicinal liquor, prepared plaster, or made as pills or powders."}
{"N0.":23,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/sunny/resources/Datura%20arborea%20L..jpg?raw=true","Name":["木本蔓陀羅","Angel’s Trumpet","Datura arborea L."],"familyGenus":"Solanaceae, Datura","partUsed":"flowers","harvestProcessing":"Collected in full bloom, sun-dried or baked to dry.","propertiesActions":"Pungent, warm.Activating qi-flow and relieving pain.","indicationsUsage":"Used for gastralgia.Oral administration: decocting, 1-3g."}
{"N0.":24,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Prunus%20armeniaca%20L.%20var.%20ansu%20Maxim.jpg?raw=true","Name":["山杏","Ansu Apricot","Prunus armeniaca L. var. ansu Maxim"],"familyGenus":"Rosaceae, Prunus","partUsed":"mature seeds","harvestProcessing":"Harvested in summer mature fruits, removed pulp and shuck, taken out seeds, and sun-dried.","propertiesActions":"Bitter, little warm; mild-toxic.Downbearing qi-flow for suppressing cough and asthma, nourishing the intestines and freeing bowel.","indicationsUsage":"Coughing and dyspnea, fullness in the chest with profuse phlegm, blood deficiency and fluid consumption, intestinal dryness with constipation.Internal: decocting (better in smashed form and later added in), 5-10g; or made as pills or powders. External: befitted amount, applied in powdered form. Be cautious in using on babies and avoid using on patients with cough due to yin deficiency or patients with diarrhea, dysentery, and sloppy stool."}
{"N0.":25,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Dichroa%20febrifuga%20Lour..jpg?raw=true","Name":["常山","Antifebrile Dichroa","Dichroa febrifuga Lour."],"familyGenus":"Saxifragaceae, Dichroa","partUsed":"roots","harvestProcessing":"Excavated in autumn; removed fibrous roots, washed, and sun-dried.","propertiesActions":"Bitter pungent, cold; toxic.Preventing malaria attack and dissolving phlegm.","indicationsUsage":"Malaria. Oral administration: decocting 5-9g; or made as pills or powders."}
{"N0.":26,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Prunus%20armeniaca%20L..jpg?raw=true","Name":["杏","Apricot","Prunus armeniaca L."],"familyGenus":"Rosaceae, Prunus","partUsed":"mature seeds","harvestProcessing":"Harvested in summer mature fruits, removed pulp and shuck, taken out seeds, and sun-dried.","propertiesActions":"Bitter, little warm; mild-toxic.Downbearing qi-flow and suppressing cough and asthma, nourishing the intestines and freeing bowel.","indicationsUsage":"Used for coughing and dyspnea, excessive phlegm due to chest distention, hemopenia due to consumption of fluid, constipation induced by dryness of the intestine.Internal: decocting (better in smashed form and later added in), 5-10g; or made as pills or powders. External: befitted amount, applied in powdered form. Be cautious in using on babies, and avoid using on patients with cough due to yin deficiency or patients with diarrhea, dysentery, and sloppy stool."}
{"N0.":27,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Adenophora%20trachelioides%20Maxim..jpg?raw=true","Name":["薺苨","Apricotleaf Ladybell","Adenophora trachelioides Maxim."],"familyGenus":"Campanulaceae, Adenophora","partUsed":"roots","harvestProcessing":"Excavated in spring. Removed stem leaves; well washed and sun-dried.","propertiesActions":"Sweet, cold.Moistening dryness, reducing phlegm. clearing heat and detoxifying.","indicationsUsage":"Xeropulmonary cough, swelling and throat pain, diabetes, furunculosis and ulcerative carbuncle, drug poisoning. Oral administration: decocting, 5-10g. External application: appropriate amount, smashed."}
{"N0.":28,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Jasminum%20sambac%20(L.)%20Ait..jpg?raw=true","Name":["艾蒿","Arabian Jasmine","Jasminum sambac (L.) Ait."],"familyGenus":"Oleaceae, Jasminum","partUsed":"flowers, leaves, roots and distillate of jasmine flowers","harvestProcessing":"Flowers: collected in June-July at the beginning of blooming, timely sun-dried or baked to dry.<br>Leaves: collected from July to October, used fresh or sundried.<br>Roots: excavated in Sept-Dec, sliced, used fresh or sundried.","propertiesActions":"Flower: pungent, little sweet, warm; regulating qi-flowing for opening depression, repelling foulness and harmonizing the middle.<br>Leaves: pungent, little bitter, warm; resolving exterior, detumescence, and detoxifying.<br>Root: bitter, hot. Toxic; anesthesia and suppressing pains<br>Distilled flower fluid: fragrant, tasteless; rebelling foulness, regulating qi-flowing, beautifying, moistening skin.","indicationsUsage":"Flower: abdominal pain due to dysentery, chest and epigastric fullness and distress, dizziness, headaches, swelling pain induced by conjunctival congestion. Oral administration: decocting, 3-10g; or prepared tea. External application: decocted for washing eyes or soaked in vegetable oil for dripping ears.<br>Leaves: fever caused by exogenous pathogens, diarrhea, dysentery, beriberi, bites by toxic insects. Oral administration: decocting, 6-10g. External application: decocted for washing or smashed for applying.<br>Root: injuries from falls, headache, insomnia. Oral administration: powdered, 1-1.5g; or milled juice. External application: smashed for applying.<br>Distilled fluid of flowers: stale air in chest and diaphragm, and for aromatic skin care products. Oral administration: made as tea. External application: applying; or decocted for bathing."}
{"N0.":29,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Artemisia%20argyi%20Levl.%20et%20Vaniot..jpg?raw=true","Name":["牛角瓜","Argy Sagebrush","Artemisia argyi Levl. et Vaniot."],"familyGenus":"Asteraceae, Artemisia","partUsed":"leaves and fruits","harvestProcessing":"Leaves: cut the aboveground parts before flowering in September of the first year and June of the second year, collected leaves and twigs and sun-dried.<br>Fruit: collected in September to October when fruits matured","propertiesActions":"Leaves: pungent, bitter, warm; warming meridians, arresting bleeding, dispelling cold, relieving pain, removing damp, checking itching.<br>Fruits: bitter, pungent, warm; similar properties to leaves, supporting warmth, relief, and internal balance.","indicationsUsage":"Leaves: indicated for hematemesis, non-traumatic hemorrhage, hemafecia, metrorrhagia and metrostaxis, hematochezia during pregnancy, irregular menstrual periods, algomenorrhea, restless fetal movements, crymodynia of the heart and abdomen, leukorrhea, eczema, sarcoptidosis, hemorrhoids, and large carbuncles; used orally as a decoction (3-10g), pills, powders, or juice. For external use, it can be triturated for application, decocted for fumigation, or stir-heated for ironing.<br>Fruits: indicated for lumbago due to kidney deficiency and inner cold due to yang asthenia; used orally in powdered form (1.5-4.5g) or made into pills."}
{"N0.":30,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Clematis%20armandii%20Franch..jpg?raw=true","Name":["小木通","Armand Clematis","Clematis armandii Franch."],"familyGenus":"Ranunculaceae, Clematis","partUsed":"vines","harvestProcessing":"Excavated in autumn, removed aboveground parts and earth, sliced and sun-dried.","propertiesActions":"Tasteless little bitter, cold, mild-toxic.Clearing heat for disinhibiting urine, freeing the network vessels and promoting lactaction.","indicationsUsage":"Edema, difficulty in micturition, stranguria and urodynia due to damp-heat in lower-JIAO.Oral administration: decocting, Chuanmutong 3-6g. Not use in cases of pregnancies, or those with weak qi and body fluid impairment, spermatorrhea or enuresis diuresis."}
{"N0.":31,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Pinus%20armandii%20Franch..jpg?raw=true","Name":["華山松","Armand’s Pine","Pinus armandii Franch."],"familyGenus":"Pinaceae, Pinus","partUsed":"leaves","harvestProcessing":"Can be harvested throughout the year, best in the last month of lunar year, sundried, stored in dried places.","propertiesActions":"Bitter, warm.Dispelling wind and drying dampness, destroying parasites for suppressing itching.","indicationsUsage":"Used for rheumatic paralysis and arthralgia, injuries from falls, insomnia, puffiness, wet sores, sarcoptidosis, epidemic meningitis, influenza, uncinariasis.Oral administration: decocting, 9-15g (fresh leaves 30-60g); or made as medicinal liquor. External application: decocted for washing."}
{"N0.":32,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Bixa%20orellana%20Linn..jpg?raw=true","Name":["紅木","Arnotto tree","Bixa orellana Linn."],"familyGenus":"Bixaceae, Bixa","partUsed":"root bark, leaves, pulp and seeds","harvestProcessing":"Collected all the year round; well washed; sun-dried.","propertiesActions":"Sour, harsh, sweet, neutral.Bringing down fever, anti-malaria and detoxifying.","indicationsUsage":"Pyrexia, malaria, pharyngalgia, jaundice, dysentery, erysipelas, venomous snake bites, pyocutaneous disease."}
{"N0.":33,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Vernonia%20cinerea%20(L.)%20Less.jpg?raw=true","Name":["夜香牛","Ashycoloured Ironweed","Vernonia cinerea (L.) Less."],"familyGenus":"Asteraceae, Vernonia","partUsed":"whole plant or roots","harvestProcessing":"Harvested whole plant in summer and autumn, washed, sundried, chopped into segments or used fresh; excavated roots in autumn and winter, washed, sliced, and sun-dried.","propertiesActions":"Bitter, pungent, cool.Dispelling pathogenic wind and clearing heat, removing dampness and detoxifying.","indicationsUsage":"Fever caused by exogenous pathogens, coughing, acute icteric hepatitis, diarrhea caused by damp-heat, leucorrhea, furunculosis and swelling, mastitis, rhinitis, venomous snake bites.Oral administration: decocting, 15-30g, fresh products 30-60g. External application: appropriate amount, powdered for applying or fresh products smashed for applying."}
{"N0.":34,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/Betula%20platyphylla%20Sukaczev.jpg?raw=true","Name":["白樺","Asian White Birch","Betula platyphylla Sukaczev"],"familyGenus":"Betulaceae, Betula","partUsed":"bark and juice from tree trunk","harvestProcessing":"Bark: collected in spring, summer, autumn, better in spring and autumn, cut up and sun-dried.<br>Juice from tree: open the bark in May; stored the juice and used fresh.","propertiesActions":"Bark: bitter, neutral; clears heat, induces urination, removes phlegm, checks cough, detoxifies.<br>Juice from trunk: bitter, cool; removes phlegm, checks cough, clears heat, detoxifies.","indicationsUsage":"Bark: indicated for pharyngitis, pharyngodynia, dyspnea, cough, jaundice, diarrhea, dysentery, stranguria, difficulty in micturition, mammary abscess, sores, and prurigo; used orally as a decoction (10-15g) or applied externally in powdered form.<br>Juice from branches: indicated for cough, breathlessness, and a sensation of heat during urination; used orally as fresh juice (20-30ml)."}
{"N0.":35,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/35Buddleja%20asiatica%20Lour..jpg?raw=true","Name":["白背風","Asiatic Butterfly-bush","Buddleja asiatica Lour."],"familyGenus":"Buddlejaceae, Buddleja","partUsed":"roots, cauline leaves and fruits.","harvestProcessing":"Roots and cauline leaves: collected any time for use, sliced, sun-dried; collected leaves in August to September, used fresh or sun-dried.<br>Fruit: collected mature fruits from March to December, used fresh or sun-dried.","propertiesActions":"Root, stem leaves: taste bitter, little pungent, warm in nature, mild-toxic; removing damp-wind, reinforcing qi and activating blood circulation<br>Fruits: taste bitter, neutral in nature; expelling parasites and dispersing swelling.","indicationsUsage":"Root, stem and leaves: Used for wind headache, rheumatic arthralgia, epigastric pain. abdominal distension, dysentery, fall injuries and fractures, unknown pyogenic infections, eczema, skin itching<br>Fruits: Used for infantile ascariasis, retarded growth due to malnutrition<br>Root, leaf: oral administration: decocting, 9-15g, fresh used 30-60g External: appropriate amount, triturated for application; or prepared decoction for washing<br>Fruit: oral administration: decocting, 10-13g."}
{"N0.":36,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/36Centella%20asiatica%20(L.)%20Urb..jpg?raw=true","Name":["積雪草","Asiatic Pennywort","Centella asiatica (L.) Urb."],"familyGenus":"Apiaceae, Centella","partUsed":"whole plant or with roots","harvestProcessing":"Harvested in summer and autumn, removed silt and sun-dried.","propertiesActions":"Bitter, pungent, cold.Clearing heat and promoting dieresis, resolving toxin and dispersing swelling.","indicationsUsage":"Used for jaundice with damp-heat pathogen, diarrhea due to sunstroke, stony and bloody stranguria, anthracia and sore, injuries caused by falls.Oral administration: decocting, 15-25g (fresh products 25-50g); or smashed to extract juice. External application: smashed for application or smashed to extract juice."}
{"N0.":37,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/37Hydrocotyle%20sibthorpioides%20Lam..jpg?raw=true","Name":["天胡荽","Asiatic Pennywort","Hydrocotyle sibthorpioides Lam."],"familyGenus":"Apiaceae, Hydrocotyle","partUsed":"entire plant","harvestProcessing":"Collected entire plant in summer and autumn, well washed, used fresh or sundried.","propertiesActions":"Pungent, little bitter, cool in nature.Clearing heat, inducing urination, detoxifying and dispersing swelling.","indicationsUsage":"Jaundice, dysentery, edema, stramgutia, corneal opacity, pharyngeal edema, anthracia and sores, acute posterior ganglionitis, injuries from falls.Oral administration: decocting, 9-15g, fresh herb 30-60g; or extracted juice. External application: appropriate amount, smashed for application; or triturated to extract juice for application."}
{"N0.":38,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/38Vicia%20unijuga%20A.%20Braun.jpg?raw=true","Name":["歪頭菜","Askew Vetch","Vicia unijuga A. Braun"],"familyGenus":"Fabaceae, Vicia","partUsed":"whole plant","harvestProcessing":"Collected in summer, washed, chopped into segments, and sun-dried.","propertiesActions":"Sweet, neutral.Replenishing deficiency and regulating liver qi, detoxifying and disinhibiting urine.","indicationsUsage":"Consumptive disease, gastralgia, dizziness, furunculosis, puffiness.Oral administration: decocting, 9-30g. External application: appropriate amount, smashed for applying."}
{"N0.":39,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/39Asparagus%20officinalis%20L..jpg?raw=true","Name":["石刁柏","Asparagus","Asparagus officinalis L."],"familyGenus":"Liliaceae, Asparagus","partUsed":"tender stems","harvestProcessing":"Collected tender stem from April to May, kept fresh, in prevention of insolation and dehydration.","propertiesActions":"Little sweet, neutral.Clearing heat and inducing urination.","indicationsUsage":"Hepatitis, psoriasis, hyperlipemia, hyperplasia of mammary glands, lymphosarcoma, carcinoma of bladder, mammary cancer, skin cancer.Internal: decocting, 15-30g."}
{"N0.":40,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/40Asparagus%20setaceus%20(Kunth)%20Jessop.jpg?raw=true","Name":["文竹","Asparagus Fern","Asparagus setaceus (Kunth) Jessop"],"familyGenus":"Liliaceae, Asparagus","partUsed":"earthnut or entire plant","harvestProcessing":"Cut tendril and stem, excavated earthnut, removed soil, boiled or steamed till the bark crack, removed the bark, cut into segments, and dried<br>Entire plant can be harvested all over the year, used fresh or sun-dried.","propertiesActions":"Sweet, little bitter, cold.Moistening lung, checking cough, cooling blood and treating stranguria.","indicationsUsage":"Yin weakness causing pulmonary dryness, cough, empsyxis, drenching and infrequent urination.Internal: decocting, 6-30g."}
{"N0.":41,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/41Hedyotis%20auricularia%20Linn..jpg?raw=true","Name":["耳草","Auricular Hedyotis","Hedyotis auricularia Linn."],"familyGenus":"Rubiaceae, Hedyotis","partUsed":"entire plant","harvestProcessing":"Collected in summer, used fresh or sundried.","propertiesActions":"Bitter, cool.Clearing heat, detoxifying, cooling blood and dispersing swelling.","indicationsUsage":"Cold and pyrexia, coughing with lung heat, swelling pain in the throat, enteritis, dysentery, piles and hemorrhage, metrorrhagia and metrostaxis, venomous snake bites, mastitis, anthracia, furuncles and swelling toxicity, eczema, injuries from falls.Oral administration: decocting, 10-15g. External application: appropriate amount, triturated for application; or prepared decoction for washing."}
{"N0.":42,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/42Akebia%20trifoliata%20(Thunb.)%20Koidz.%20var.%20australis%20(Diels)%20T.%20Shimizu.jpg?raw=true","Name":["白木通","Austral Akebia","Akebia trifoliata (Thunb.) Koidz. var. australis (Diels) T. Shimizu"],"familyGenus":"Lardizabalaceae, Akebia","partUsed":"dried roots and canes; dried or nearly mature fruits","harvestProcessing":"dried roots and canes: harvested in autumn, cut the stem, removed branches and sun-dried.<br>dried or nearly mature fruits: harvested greenish yellow fruits in summer and autumn, sun-dried or scald in boiled water and dried.","propertiesActions":"dried roots and canes: bitter, little cold; clearing heat of heart, inducing urination, clearing meridians and promoting lactation<br>dried or nearly mature fruits:bitter, cold; soothing the liver and regulating the normal flow of qi, promoting blood circulation and arresting pain, inducing urination and expelling parasites.","indicationsUsage":"dried roots and canes: restlessness accompanied by thoracic fever, pharyngitis and pharyngodynia, dark urine, five types of stranguria, edema, generic contracting pain, amenorrhea and insufficient milk in lactating mothers; decocting, 3-6g; or made as pills or powders<br>dried or nearly mature fruits:gastric and costal swelling pain, amenorrhea and algomenorrhea, difficulty in urination, bites by snakes and insects; oral administration: decocting, 9-15g; large amount up to 30-60g; or made as medicinal liquor."}
{"N0.":43,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/43Gymnema%20sylvestre%20(Retz.)%20Schult..jpg?raw=true","Name":["匙羹藤","Australian Cow-plant","Gymnema sylvestre (Retz.) Schult."],"familyGenus":"Asclepiadaceae, Gymnema","partUsed":"roots, or tender branches and leaves","harvestProcessing":"Roots: collected throughout the year, well washed, sliced, sun-dried or used fresh<br>Branches and leaves: collected in spring and used fresh.","propertiesActions":"Taste little bitter, cool in nature, toxic.Removing wind, relieving pain, detoxifying and dispersing swelling.","indicationsUsage":"Used for rheumatic arthralgia, swelling pain in the throat, scrofula, mammary abscess, sores and furuncles, eczema, unknown pyogenic infections, venomous snake bites.Oral administration: decocting, 15-30g. External application: appropriate amount, triturated for application."}
{"N0.":44,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/44Zephyranthes%20candida%20(Lindl.)%20Herb..jpg?raw=true","Name":["蔥蓮","Autumn Zephyrlily","Zephyranthes candida (Lindl.) Herb."],"familyGenus":"Amaryllidaceae, Zephyranthes","partUsed":"whole plant","harvestProcessing":"Can be harvested throughout the year, washed, mostly used fresh.","propertiesActions":"Sweet, neutral.Suppressing hyperactive liver and pathogenic wind.","indicationsUsage":"Infantile frightened epilepsy, epilepsy, tetanus.Oral administration: decocting, 3-4 herbs; or extracted juice. External application: appropriate amount, smashed for applying."}
{"N0.":45,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/45Scutellaria%20baicalensis%20Georgi.jpg?raw=true","Name":["黃芩","Baikal Skullcap","Scutellaria baicalensis Georgi"],"familyGenus":"Lamiaceae, Scutellaria","partUsed":"roots","harvestProcessing":"After cultivation of 2-3 years, excavated after autumn when stem leaves wither, removed stem leaves near root, sun-dried to half dried, knocked off bark, sun-dried or baked to dry.","propertiesActions":"Bitter, cold.Clearing heat and discharging fire, eliminating dampness and detoxifying, relieving hemorrhage and quieting the fetus.","indicationsUsage":"Cough with lung heat, fever and coma, headache induced by hepatic fire, swelling pain induced by conjunctival congestion, jaundice with damp-heat pathogen, dysentery, pyretic stranguria, hematemesis and non-traumatic hemorrhage, metrorrhagia and metrostaxis, fetal movement with fever, anthracia and furunculosis, deficiency cold of the spleen, prohibited to patients with poor appetite and loose stool.Oral administration: decocting, 3-9g; or made as pills or powders; External application: appropriate amount, decocted for washing, or powdered for applying."}
{"N0.":46,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/46Angelica%20dahurica%20(Fisch.%20ex%20Hoffm.)%20Benth.%20et%20Hook.%20f.%20ex%20Franch.%20et%20Sav..jpg?raw=true","Name":["白芷","Baizhi Angelica","Angelica dahurica (Fisch. ex Hoffm.) Benth. et Hook. f. ex Franch. et Sav."],"familyGenus":"Apiaceae, Angelica","partUsed":"roots or leaves","harvestProcessing":"Collected in summer and autumn, removed foreign matters, well washed, mixed with lime, a week later, put it out, sun-dried, or dried in low temperature. Removed foreign matters, divided by size, immersed briefly, moistened fully, cut into thick sections and sun-dried.","propertiesActions":"Pungent, warm.Removing wind to relieve exterior syndrome, relieving pain, dispersing swelling, clearing pus, moistening dryness and reducing leukorrhea","indicationsUsage":"Used for headaches caused by cold, persistent turbid nasal discharge, toothache, leucorrhea, anthracia and swelling pain, skin dryness and itching, sarcoptidosis. Oral administration: decoction, 0.8-2 qian; or prepare pills, powder. External: grind into powder, cast or apply.For chills, fever, headache or forehead pain: angelica root, fermented soya beans, scallion, liquorice, ginger and fructus Ziziphi jujubae used together."}
{"N0.":47,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/47Zingiber%20zerumbet%20(Linn.)%20Roscose%20ex%20Smith.jpg?raw=true","Name":["紅球薑","Ball Ginger","Zingiber zerumbet (Linn.) Roscose ex Smith"],"familyGenus":"Zingiberaceae, Zingiber","partUsed":"rhizome","harvestProcessing":"Can be harvested throughout the year, and sun-dried.","propertiesActions":"Pungent, warm.Promoting blood circulation for dispelling stasis, promoting qi-flowing for suppressing pains, warming the middle and arresting diarrhea, dispersing accumulations and abducting stagnation.","indicationsUsage":"Treats various blood stasis due to stagnancy of liver qi, treats qi-stagnating stomachodynia, stomachache, algomenorrhea, treats diarrhea due to deficiency-cold in middle-JIAO, dyspepsia, etc. , retention of food in the stomach.Oral administration: decocting, 9-15g."}
{"N0.":48,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/48Echinops%20latifolius%20Tausch.jpg?raw=true","Name":["禹州漏蘆","Ballflower Globethistle","Echinops latifolius Tausch"],"familyGenus":"Asteraceae, Echinops","partUsed":"roots","harvestProcessing":"Harvested after autumn, removed earth, used fresh or sundried.","propertiesActions":"Bitter, cold.Clearing heat-toxin; promoting blood circulation for promoting lactation.","indicationsUsage":"Sores and swelling; mammary abscess; parotid bubo; tubercle; hemorrhoids and fistula; scabies, tinea and prurigo; conjunctival congestion and swelling pain; dysentery; early abdominal pain; rheumatic arthralgia and pain; sudden sprain in the lumbar region; injuries caused by falls; lack of lactation after delivery.Oral administration: decocting, 9-15g. External application: appropriate amount, powdered for application after mixed with vinegar; or fresh products smashed for application. Not use in cases of pregnancies and those with skin and external diseases or yin symptom."}
{"N0.":49,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/49Platycodon%20grandiflorum%20(Jacq.)%20A.%20DC..jpg?raw=true","Name":["桔梗","Balloon Flower","Platycodon grandiflorum (Jacq.) A. DC."],"familyGenus":"Campanulaceae, Platycodon","partUsed":"dried roots","harvestProcessing":"Excavated in spring and autumn, washed, removed fibrous roots, peeled the outer skin when fresh or dried with outer skin.","propertiesActions":"Bitter, pungent, neutral.Dispersing lung qi, disinhibiting the throat, dispelling phlegm, expelling pus.","indicationsUsage":"Cough with asthma, excessive phlegm, indisposition due to chest distress, pharyngalgia, hoarse voice, pulmonary abscess and pyemesis, pyocutaneous disease that is not healed.Oral administration: decocting, 3-10g; or made as pills or powders. External application: appropriate amount, incinerated and powdered for applying."}
{"N0.":50,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/50Cardiospermum%20halicacabum%20L..jpg?raw=true","Name":["倒地鈴","Balloon Vine","Cardiospermum halicacabum L."],"familyGenus":"Sapindaceae, Cardiospermum","partUsed":"entire plant or fruits","harvestProcessing":"Collected entire plant in summer and autumn, removed foreign matters, sundried<br>collected fruits in autumn and winter and sun-dried.","propertiesActions":"Bitter, pungent, cold.Clearing heat, inducing urination, cooling blood and detoxifying.","indicationsUsage":"Jaundice, stranguria, eczema, furunculosis and swelling, venomous snake bites, injuries from falls.Internal: decocting, 9-15g, fresh used 30-60g. External: appropriate amount, triturated for application; or prepared decoction for washing."}
{"N0.":51,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/51Momordica%20charantia%20Linn..jpg?raw=true","Name":["苦瓜","Balsamper","Momordica charantia Linn."],"familyGenus":"Cucurbitaceae, Momordica","partUsed":"fruits","harvestProcessing":"Harvested fruits in autumn, sliced, sun-dried or used fresh.","propertiesActions":"Bitter, cold.Dispelling summer-heat, improving eyesight and detoxifying.","indicationsUsage":"Mainly indicated for pseudopyrexia, restlessness, thirst in summer, diabetes, pain induced by conjunctival congestion, dysentery, anthracia and swelling.Oral administration: decocting, 6-15g, fresh products 30-60g; or burnt preserving nature of drugs partly and powdered. External application: appropriate amount, fresh products smashed for applying; or extracted juice for unction. Use with caution in cases of deficient-cold in spleen and stomach."}
{"N0.":52,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/52Zanthoxylum%20planispinum%20Sieb.%20Et%20Zucc..jpg?raw=true","Name":["竹葉椒","Bambooleaf Pricklyash","Zanthoxylum planispinum Sieb. Et Zucc."],"familyGenus":"Rutaceae, Zanthoxylum","partUsed":"fruits","harvestProcessing":"Cut the fruit cluster before fruits cracking, and sun-dried.","propertiesActions":"Sweet, warm.Dispersing cold, suppressing pains and dispelling roundworms.","indicationsUsage":"Used for gastric cold and abdominal pain due to roundworms, toothaches, wet sores.Oral administration: decocting, 6-9g; powdered, 1.5-3g per time. External application: decocted for washing."}
{"N0.":53,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/53Musa%20nana%20Lour.jpg?raw=true","Name":["香蕉","Banana","Musa nana Lour"],"familyGenus":"Musaceae, Musa","partUsed":"fruits","harvestProcessing":"Collected when fruits nearly mature, used fresh or sundried.","propertiesActions":"Taste sweet, cold in nature.Clearing heat, moistening the lung, laxation and detoxifying.","indicationsUsage":"Pyreticosis and dipsesis, xeropulmonary cough, constipation, hemorrhoids.Oral administration: raw eaten or stewed, 1-4 ones."}
{"N0.":54,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/54Michelia%20figo%20(Lour.)%20Spreng..jpg?raw=true","Name":["含笑","Banana Shrub","Michelia figo (Lour.) Spreng."],"familyGenus":"Magnoliaceae, Michelia","partUsed":"buds and leaves","harvestProcessing":"Harvested on the morning of sunny days in flowering phrase, air-dried or baked to dry in low temperature.","propertiesActions":"Pungent, bitter, neutral.Fragrance: eliminating dampness.","indicationsUsage":"Flower bud: irregular menstrual periods, qi-stagnating abdominalgia, rhinitis<br>Leaves: injuries from falls.Buds: oral administration: decocting, 10-15g<br>Leaves: external application: fresh products appropriate amount, smashed for applying on affected parts."}
{"N0.":55,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/55Rosa%20banksiae%20W.%20T.Ait..jpg?raw=true","Name":["木香花","Bank’s Rose","Rosa banksiae W. T.Ait."],"familyGenus":"Rosaceae, Rosa","partUsed":"roots or leaves","harvestProcessing":"Harvested leaves in summer, and sun-dried<br>Excavated roots in summer and autumn, washed off earth, sliced, and sun-dried.","propertiesActions":"Harsh, neutral.Inducing astringency to the intestine, relieving diarrhea, detoxifying and relieving hemorrhage.","indicationsUsage":"Diarrhea, dysentery, sores and furuncles, hypermenorrhea, hemafecia.Oral administration: decocting, 9-15g. External application: appropriate amount, powdered for dusting; or leaves smashed, applied after mixed with fluid."}
{"N0.":56,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/56Lycium%20barbarum%20L..jpg?raw=true","Name":["寧夏枸杞","Barbary Wolfberry","Lycium barbarum L."],"familyGenus":"Solanaceae, Lycium","partUsed":"fruits and leavs","harvestProcessing":"fruits: fruits mature in June-Nov continuously, collected in batches, quickly spread on reed cane, less than 3cm thick, better 1.5cm and dried in shady and cool places till the skin wrinkles, then sun-dried till pericarp get hard, removed peduncle when pulp is still soft, sun-dried again<br>leaves: picked in spring to early summer, washed, often used fresh.","propertiesActions":"fruits:sweet, neutral; nourishing the liver and kidney and moistening the lung<br>leaves: bitter, sweet; cool in nature; supplementing deficiency for boosting essence and clearing heat for improving eyesight","indicationsUsage":"Barbary wolfberry fruit: liver-kidney deficiency, lightheadedness and dizziness, blurred vision, relative weakness in the loins and knees, impotence and seminal emission, coughing with asthma due to consumptive disease, thirst due to diabetes<br>Barbary wolfberry leaves: deficient fever, dipsesis, astrigent pain induced by conjunctival congestion, cataract, nephelium and night blindness, metrorrhagia and metrostaxia, thracia and sores due to toxic heat.Gouqizi: oral administration: decocting, 5-15g, or made as pills, powders, paste or vinum<br>Gouqiye: oral administration: decocting, fresh products 60-240g; or cooked; or pounded to extract juice. External application: appropriate amount, decocted for washing; or pounded to extract juice for dripping eyes."}
{"N0.":57,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/57Hordeum%20vulgare%20L..jpg?raw=true","Name":["大麥","Barley","Hordeum vulgare L."],"familyGenus":"Poaceae, Hordeum","partUsed":"fruits","harvestProcessing":"Immersed barley with water, fish out and place on basket, covered it with cattail bag, often watering, taken out and sun-dried when sprout grow 3-5mm long.","propertiesActions":"Sweet, salt, cool, non-toxic.Tonifying stomach, lubricating intestines and inducing urination.","indicationsUsage":"Diarrhea due to dyspeptic retention, painful stramgutia, edema, scalding and burns, chronic osteomyelitis.Oral administration: decocting, 50-100g; or powdered. External application: stir-heated and powdered for application, or prepared decoction for washing."}
{"N0.":58,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/58Cinnamomum%20burmannii%20(C.G.et%20Th.Ness)%20Blume.jpg?raw=true","Name":["陰香","Batavia Cinnamon","Cinnamomum burmannii (C.G.et Th.Ness) Blume"],"familyGenus":"Lauraceae, Cinnamomum","partUsed":"bark, roots and leaves","harvestProcessing":"Bark: picked off in summer and sun-dried<br>Roots: excavated in autumn, washed off loam, cut into segments, sun-dried; or stripped root coat and sun-dried<br>Leaves: harvested in autumn and sun-dried.","propertiesActions":"Bark:pungent, little sweet, warm; warming spleen for suppressing pains, dispelling wind and cold, removing toxin for detumescence and relieving hemorrhage<br>Roots: pungent, little sweet, warm; warming spleen for activating qi-flowing and suppressing pains<br>Leaves: pungent, little sweet, warm, dispelling pathogenic wind and removing dampness, relieving diarrhea and relieving hemorrhage.","indicationsUsage":"Bark: cold gastralgia, diarrhea and stomachache, poor appetite, anemofrigid-damp arthralgia, pain in loin and legs, injuries caused by falls, traumatic hemorrhage, ulcer, furuncle and swelling toxicity<br>Root: cold epigastric pain, qi-stagnating cardiodynia, watery diarrhea<br>Leaves: itchy skin eruptions, rheumatic arthralgia, diarrhea, abdominal pain due to dysentery, constipation due to cold, swelling toxicity, and external hemorrhage.Bark: oral administration: decocting, 6-9g; or powdered, 1.5-3g every time. External application: appropriate amount, powdered for application after mixed with wine; or made as medicinal liquor for erasing. Roots: oral administration: decocting, 3-9g. Leaves: oral administration: decocting, 3-6g. External application: appropriate amount, powdered for application or decocted for washing."}
{"N0.":59,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/59Ipomoea%20pescaprae%20(L.)%20Sweet.jpg?raw=true","Name":["馬鞍藤","Beach Morningglory","Ipomoea pescaprae (L.) Sweet"],"familyGenus":"Convolvulaceae, Ipomoea","partUsed":"whole plant","harvestProcessing":"Collected in summer, autumn or all the year round, removed impurities, chopped into segments or pieces, and sun-dried.","propertiesActions":"Pungent; bitter; little cold.Dispelling pathogenic wind and removing dampness; eliminating carbuncle and dissipating binds.","indicationsUsage":"Rheumatic arthralgia, anthracia, furunculosis, mammary abscess, prolapse of hemorrhoids.Oral administration: decocting, fresh products 30-60g. External application: appropriate amount, smashed for applying; or burnt preserving nature then powdered for applying."}
{"N0.":60,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/60Mahonia%20bealei%20(Fort.)%20Carr..jpg?raw=true","Name":["闊葉十大功勞","Beal’s Mahonia","Mahonia bealei (Fort.) Carr."],"familyGenus":"Berberidaceae, Mahonia","partUsed":"stems","harvestProcessing":"Can be harvested throughout the year, cut into segments, and sun-dried.","propertiesActions":"Bitter, neutral.Clearing the lung for suppressing cough, destroying parasites for freeing bowel, supplementing yin for quenching thirst.","indicationsUsage":"Coughing with lung heat, parasitic disease, constipation, diabetes.Oral administration: decocting, 10-15g."}
{"N0.":61,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/61Lespedeza%20Formosa%20(Vog.)%20Koehne.jpg?raw=true","Name":["美麗胡枝子","Beautiful Lespedeza","Lespedeza Formosa (Vog.) Koehne"],"familyGenus":"Fabaceae, Lespedeza","partUsed":"stem leaves","harvestProcessing":"Collected before flowers open, used fresh or chopped into segments, and sun-dried.","propertiesActions":"Taste bitter, neutral in nature.Clearing heat, disinhibiting urine and relieving strangury.","indicationsUsage":"Used for pyretic stranguria, difficulty in micturition.Oral administration: decocting, 30-60g."}
{"N0.":62,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/62Phyllodium%20pulchellum%20(L.)%20Desv..jpg?raw=true","Name":["排錢樹","Beautiful Phyllodium","Phyllodium pulchellum (L.) Desv."],"familyGenus":"Fabaceae, Phyllodium","partUsed":"aboveground parts","harvestProcessing":"Collected in summer, cut up in summer, sun-dried or used fresh.","propertiesActions":"Tasteless, bitter, neutral; mild-toxic.Clearing heat for inducing diuresis, promoting blood circulation for dispelling stasis, softening hardness and dissipating binds.","indicationsUsage":"Used for cold and pyrexia, malaria, hepatitis, abdominal dropsy due to cirrhosis, splenohepatomegaly due to schistosomiasis, pain from rheumatism, injuries from falls.Oral administration: decocting, 6-15g (fresh products 60-120g); or made as medicinal liquor. External application: smashed for applying."}
{"N0.":63,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/63Euphorbia%20pekinensis%20Rupr..jpg?raw=true","Name":["大戟","Beijing Spurge","Euphorbia pekinensis Rupr."],"familyGenus":"Euphorbiaceae, Euphorbia","partUsed":"roots","harvestProcessing":"Excavated in autumn and winter, washed, and sun-dried.","propertiesActions":"Bitter, cold, toxic.Expelling water and drink.","indicationsUsage":"Edema and tumescence, dropsy in thoracic and abdominal cavities, unsmooth urine and stool, phlegm and retained fluid, shortness of breath due to adverse rising of qi.Oral administration: decocting, 1.5-3g. Not use in cases of pregnancies. Not administer with liquorice."}
{"N0.":64,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/64Areca%20catechu%20L..jpg?raw=true","Name":["檳榔","Betelnut Palm","Areca catechu L."],"familyGenus":"Arecaceae, Areca","partUsed":"pericarp","harvestProcessing":"Collected mature fruits in winter and spring, stripped pericarp, loosened, immersed, sundried, loosen again and removed epicarp.","propertiesActions":"Bitter, cold.Clearing heat, drying dampness, discharging fire, removing deficiency- heat, detoxifying and curing wound.","indicationsUsage":"Fullness of chest and abdomen, beriberi, edema.Internal: decocting, 10-15g; or made as pills. External: prepared decoction for washing, or triturated for application."}
{"N0.":65,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/65Piper%20longum%20L..jpg?raw=true","Name":["蓽茇","Biba Pepper","Piper longum L."],"familyGenus":"Piperaceae, Piper","partUsed":"dried, nearly mature or mature fruit cluster","harvestProcessing":"Harvested when fruit cluster turn black from green, removed impurities, and sun-dried.","propertiesActions":"Pungent, hot.Warming the middle for dispersing cold, depressing qi for suppressing pains.","indicationsUsage":"Cold pain of gastric cavity and abdomen, vomiting, diarrhea, hemicrania, externally used for toothache.Oral administration: decocting, 1-3g; or made as pills or powders. External application: appropriate amount, powdered; or made as pills for squeezing in dental caries hole, or made as medicinal liquor for spreading on affected parts."}
{"N0.":66,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/66Dendropanax%20proteus%20(Champ.)%20Benth..jpg?raw=true","Name":["變葉樹參","Biformaleaf Dendropanax","Dendropanax proteus (Champ.) Benth."],"familyGenus":"Araliaceae, Dendropanax","partUsed":"roots, stems or bark","harvestProcessing":"Collected in autumn and winter, sliced, sun-dried for future use.","propertiesActions":"Taste sweet, pungent, and warm in nature.Dispelling pathogenic wind and removing dampness, promoting blood circulation for detumescence, soothing the sinews and quickening the meridians.","indicationsUsage":"Used for rheumatic arthralgia, hemiparalysis, headaches, irregular menstrual periods, injuries from falls, swelling sores.Oral administration: decocting, 15-30g, large dosage up to 45g; or made as medicinal liquor. External application: appropriate amount smashed for application; or decocted for washing."}
{"N0.":67,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/67Tagetes%20erecta%20L..jpg?raw=true","Name":["萬壽菊","Big Marigold","Tagetes erecta L."],"familyGenus":"Asteraceae, Tagetes","partUsed":"flowers","harvestProcessing":"Collected flower in summer and autumn, used fresh or sundried","propertiesActions":"Bitter, little pungent, cool.Clearing heat, detoxifying, removing phlegm and checking cough.","indicationsUsage":"Upper respiratory infection, whooping cough, conjunctivitis, stomatitis, toothache, pharyngitis, vertigo, infantile frightened epilepsy, menostasia, abdominal pain due to blood stasis, anthracia and swelling toxicity.Oral administration: decocting, 3-9g. External application: appropriate amount, prepared decoction for fumigating and washing or powdered for application, or triturated for application."}
{"N0.":68,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/68Rhodiola%20crenulata%20(Hook.%20f.%20et%20Thoms.)%20H.%20Ohba.jpg?raw=true","Name":["大花紅景天","Bigflower Rhodiola","Rhodiola crenulata (Hook. f. et Thoms.) H. Ohba"],"familyGenus":"Crassulaceae, Rhodiola","partUsed":"dried roots and rhizome","harvestProcessing":"Excavated in autumn when anthocaulus wither, removed bark, washed, and sun-dried.","propertiesActions":"Sweet, bitter, neutral.Benefiting qi-flow and promoting blood circulation, freeing arteries and veins and calming panting.","indicationsUsage":"Deficiency of vital energy and blood stasis, cardiac pain due to thoracic obstruction, stroke and hemiparalysis, lassitude and breathlessness.Oral administration: decocting, 9-12g."}
{"N0.":69,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/69Rhinacanthus%20nasutus%20(L.)%20Kurz.jpg?raw=true","Name":["白鶴靈芝","Bignose Rhinacanthus","Rhinacanthus nasutus (L.) Kurz"],"familyGenus":"Acanthaceae, Rhinacanthus","partUsed":"branches and leaves","harvestProcessing":"Harvested in spring and summer, washed, used fresh or sundried.","propertiesActions":"Taste sweet; little bitter; little cold in nature.Clearing lung-heat and moistening; destroying parasites for suppressing itching.","indicationsUsage":"Over-strained cough, sarcoptidosis, and eczema.Oral administration: decocting, 10-15g, fresh products double in amount. External application: fresh products, appropriate amount, smashed for applying."}
{"N0.":70,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/70Grewia%20biloba%20var%20parviflora%20auct.non%20Hand.-Mazz..jpg?raw=true","Name":["扁擔杆","Bilobed grewia","Grewia biloba var parviflora auct.non Hand.-Mazz."],"familyGenus":"Tiliaceae, Grewia","partUsed":"entire plant","harvestProcessing":"Collected in summer and autumn, well washed, sun-dried and used fresh.","propertiesActions":"Sweet, bitter, warm.Strengthening spleen, reinforcing qi, removing wind and damp, arresting spontaneous emission and leukorrhagia.","indicationsUsage":"Poor appetite due to splenic asthenia, anal prolapse due to long term diarrhea, malnutritional stagnation and ascariasis, rheumatic arthralgia, emissions, metrorrhagia and metrostaxis, leukorrhea, prolapsus uteri.Oral administration: decocting, 9-15g; or made as medicinal liquor. External application: appropriate amount, fresh herb triturated for application."}
{"N0.":71,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/71Magnolia%20biondii%20Pamp..jpg?raw=true","Name":["望春花","Biond’s Magnolia","Magnolia biondii Pamp."],"familyGenus":"Magnoliaceae, Magnolia","partUsed":"dried buds","harvestProcessing":"Collected in later winter and early spring before flowering, after branches removed and dried in the shade.","propertiesActions":"Pungent, warm.Dispersing wind-cold and freeing nasal orifices.","indicationsUsage":"Headache induced by chills and fever, nasal obstruction, persistent turbid nasal discharge, thick nasal discharge.Oral administration: decocting, 3-10g, better wrap-boiled; or made as pills or powders. External application: appropriate amount, powdered for nose suction; or distillated for nose dripping."}
{"N0.":72,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/72Neottopteris%20nidus%20(Linn.)%20J.%20Smith.jpg?raw=true","Name":["巢蕨","Bird-nest Fern","Neottopteris nidus (Linn.) J. Smith"],"familyGenus":"Aspleniaceae, Neottopteris","partUsed":"entire plant and rhizome","harvestProcessing":"Collected throughout the year, well washed, used fresh or sundried.","propertiesActions":"Taste bitter, warm in nature.Strengthening muscle and bone, activating blood and dissipating stasis.","indicationsUsage":"Used for fractures, impotence, injuries from falling.Oral administration: decocting, 10-15g; or made as medicinal liquor. External application: appropriate amount, triturate fresh materials for application."}
{"N0.":73,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/73Mucuna%20birdwoodiana%20Tutcher.jpg?raw=true","Name":["巢白花油麻藤","Birdwood’s Mucuna","Mucuna birdwoodiana Tutcher"],"familyGenus":"Fabaceae, Mucuna","partUsed":"rattan","harvestProcessing":"Can be harvested throughout the year, sliced, and sun-dried.","propertiesActions":"Bitter, sweet, neutral.Replenishing the blood, freeing the meridians and strengthening sinew-bone.","indicationsUsage":"Used for anemia, leucopenia, irregular menstrual periods, pain in loin and legs.Oral administration: decocting, 9-30g."}
{"N0.":74,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/74Polygonum%20bistorta%20L..jpg?raw=true","Name":["拳參","Bistort Knotweed","Polygonum bistorta L."],"familyGenus":"Polygonaceae, Polygonum","partUsed":"rhizome","harvestProcessing":"Excavated in spring when sprouting or in autumn when stem leaves wither, removed sediment, sundried and removed fibril.","propertiesActions":"Bitter, harsh, little cold.Clearing heat-toxin, reducing swelling and relieving hemorrhage.","indicationsUsage":"Used for hematodiarrhoea, pyrextic diarrhea, coughing with lung heat, anthracia, scrofula.Oral administration: decocting, 5-12g; or made as pills or powders. External application: appropriate amount, smashed for applying; or decocted for mouth rinse, fumigating and washing. Use with caution in cases of excess fire and heat."}
{"N0.":75,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/75Erigeron%20acer%20Linn..jpg?raw=true","Name":["飛蓬","Bitter Gentian","Erigeron acer Linn."],"familyGenus":"Asteraceae, Erigeron","partUsed":"fruits","harvestProcessing":"Harvested inflorescence in flowering phase, and sun-dried. Harvested fruits at fruiting, removed impurities, and sun-dried.","propertiesActions":"Flower: bitter, cold.Flowers: clearing heat. Fruits: relieving diarrhea.","indicationsUsage":"Flower: febrile illness. Fruits: bloody diarrhea.Flowers: oral administration: decocting, 9-15g. Fruits: oral administration: decocting, 6-12g."}
{"N0.":76,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/76Phyllostachys%20nigra%20(Lodd.)%20Munro.jpg?raw=true","Name":["紫竹","Black Bamboo","Phyllostachys nigra (Lodd.) Munro"],"familyGenus":"Poaceae, Phyllostachys","partUsed":"rhizome","harvestProcessing":"Harvested throughout the year, washed, and sun-dried.","propertiesActions":"Taste pungent, tasteless, cool in nature.Dispelling pathogenic wind and removing dampness, promoting blood circulation and detoxifying.","indicationsUsage":"Used for rheumatic arthralgia, aching pain of bones and muscles, menostasia, small speckles, bites by mad dogs.Oral administration: decocting, 15-30g."}
{"N0.":77,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/77Rhodotypos%20scandens%20(Thunb.)%20Makino.jpg?raw=true","Name":["雞麻","Black Jetbead","Rhodotypos scandens (Thunb.) Makino"],"familyGenus":"Rosaceae, Rhodotypos","partUsed":"fruits and roots","harvestProcessing":"Excavated roots in summer and autumn, washed, sliced, and sun-dried. Collected fruits from June-Sept., and sun-dried.","propertiesActions":"Sweet, neutral.Replenishing the blood and benefiting kidney qi.","indicationsUsage":"Mainly indicated for renal deficiency due to hemopenia.Oral administration: decocting, 15-30g. Not in compatibility with acid and pungent food, leaf mustard, turnipaphid."}
{"N0.":78,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/78Hyoscyamus%20niger%20L..jpg?raw=true","Name":["茛菪","Black Jurinea","Hyoscyamus niger L."],"familyGenus":"Solanaceae, Hyoscyamus","partUsed":"leaves and roots","harvestProcessing":"Leaves: for autumn sown ones, collected old leaves on sunny days in Feb-April, finally, picked all the leaves 5-6 days before collecting seeds, and sun-dried. Roots: collected whole plant, cut off the roots, washed, sundried, or used fresh. Seeds: collected in early June for autumn sown ones, in mid-July the spring sown ones, western areas from Aug-Sept, when the lower pericarp turn the same color, the upper seeds turn full and faint yellow, cut from the branch axis, put in ventilated place for one week, threshed and sundried.","propertiesActions":"Henbane: bitter, pungent, warm, very toxic. Poison tobacco leaves: bitter, pungent, cold, toxic. Poison tobacco root: bitter, cold, very toxic.Tianxianzi: resolving stream and pacifying gush, pacifying the heart and setting epilepsy. Gendangye: analgesia, spasmolysis. Gendanggen: preventing malaria attack and ringworms and killing parasites.","indicationsUsage":"Hyoscyamus nigar: pain in the gastric cavity and abdomen, rheumatic arthralgia, anemogenous toothaches, injury pains caused by falls, unrelieved dispnea and cough, proctoptosis with chronic dysentery, vesania, frightened epilepsy, anthracia and sores. Poison Tobacco root: analgesia, spasmolysis. Poison Tobacco leaves: pain in the gastric cavity and abdomen, toothaches, dyspnea and coughing.Tianxianzi: oral administration: decocting, 0.6-1.2g; powders, 0.06-0.6g. External application: appropriate amount, powdered for applying; decocted for washing; or burnt for fumigating. Gendangye: oral administration: powdered, 0.1-0.16%; or added into tobacco for fumigating. Gendanggen: oral administration: burnt preserving nature, powdered, 0.3-0.6g. External application: appropriate amount, smashed for applying."}
{"N0.":79,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/79Robinia%20pseudoacacia%20L..jpg?raw=true","Name":["刺槐","Black Locust","Robinia pseudoacacia L."],"familyGenus":"Fabaceae, Robinia","partUsed":"flowers","harvestProcessing":"Collected inflorescence in June-July when flowering, picked flowers and air-dried.","propertiesActions":"Sweet, neutral.Relieving hemorrhage.","indicationsUsage":"Used for hematochezia, empsyxis, metrorrhagia and metrostaxis.Oral administration: decocting, 9-15g, or prepared tea."}
{"N0.":80,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/80Solanum%20nigrum%20L..jpg?raw=true","Name":["刺槐","Black Nightshade","Solanum nigrum L."],"familyGenus":"Solanaceae, Solanum","partUsed":"entire plant","harvestProcessing":"Entire plant and roots: excavated in summer and autumn, used fresh or sundried. Seeds: collected in autumn when fruits become mature, used fresh or sundried.","propertiesActions":"Nightshade seed: bitter, cold. Nightshade root: bitter, cold.Seed: clearing heat, detoxifying, removing phlegm, checking cough; root: clearing heat, inducing urination, activating blood and detoxifying.","indicationsUsage":"Black nightshade seed: Swelling pain in the throat, furunculosis, dyspnea and cough, black nightshade root: dysentery, stranguria with turbid urine, urinary calculus, leucorrhea, anemogenous toothache, injuries from falls, superficial infection, toxic swelling, black nightshade seed: Oral administration: an appropriate amount, mouthwash with decoction or grind into paste and apply.Oral administration: decocting, 6-9g, or made as medicinal liquor; root: decocting, 9-15g, double dose for fresh use. External application: appropriate amount, triturated for application or powdered for application."}
{"N0.":81,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/81Piper%20nigrum%20L..jpg?raw=true","Name":["胡椒","Black Pepper","Piper nigrum L."],"familyGenus":"Piperaceae, Piper","partUsed":"dried, nearly mature or mature fruits","harvestProcessing":"Harvested in late autumn to the next spring when fruits turn dark green, sundried, that is black pepper; harvested red fruits, immersed in water for several days, rubbed off pulp, sundried, that is white pepper.","propertiesActions":"pungent, hot.Warming the middle for dispersing cold, depressing qi and dissipating phlegm.","indicationsUsage":"Gastrofrigid vomiting, diarrhea and stomachache, poor appetite, epilepsy and excessive phlegm.Oral administration: decocting, 1-3g; or made as pills or powders. External application: appropriate amount, powdered for applying, or prepared ointment for external compress."}
{"N0.":82,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/82Belamcanda%20chinensis%20(L.)%20DC..jpg?raw=true","Name":["射幹","Black-berry Lily","Belamcanda chinensis (L.) DC."],"familyGenus":"Iridaceae, Belamcanda","partUsed":"roots and stems","harvestProcessing":"Excavated in spring and autumn, removed soil, removed stem and fibrous root, half sundried, burnt off fibrous root and sun-dried again.","propertiesActions":"Bitter, cold, toxic.Detoxify, benefiting throat, clearing heat, removing phlegm, dissipating heat and removing stasis.","indicationsUsage":"Swelling and pain in throat, cough with dyspnea, stagnation with phlegm and saliva, scrofula and tuberculosis, malarial nodule, menostasia, anthracia and sore.Internal: decocting, 4-7.5g; powdered or extracted juice for fresh use. External: powdered for blowing into throat, or triturated for application."}
{"N0.":83,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/83Cynanchum%20atratum%20Bunge.jpg?raw=true","Name":["白薇","Blackend Mosquitotrap","Cynanchum atratum Bunge"],"familyGenus":"Asclepiadaceae, Cynanchum","partUsed":"roots","harvestProcessing":"Can be harvested in early spring, late autumn, better in autumn. After harvested, removed the aerial parts, washed and sun-dried.","propertiesActions":"Bitter, salt, cold, non-toxic.Clearing hot and cooling the blood.","indicationsUsage":"Yin asthenia generating intrinsic heat, anemogenous febrile disease, scorching, and insomnia, hemoptysis due to lung-heat, pyrexial malaria, malaria with high fever, deficient restlessness and hematic syncope postpartum, pyretic stranguria, bloody stranguria, rheumatalgia, scrofula.Oral administration: decocting, 7.5-15g; or made as pills or powders."}
{"N0.":84,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/84Haemanthus%20multiflorus%20Martyn.jpg?raw=true","Name":["網球花","Blood Lily","Haemanthus multiflorus Martyn"],"familyGenus":"Amaryllidaceae, Haemanthus","partUsed":"bulb","harvestProcessing":"Excavated bulb in autumn, removed soil and sand, often used fresh, or sliced and sundried.","propertiesActions":"Pungent, cool.Detoxifying and dispersing swelling.","indicationsUsage":"Furuncles, furuncles, anthracia, unknown pyogenic infections.Oral administration: decocting, 9-20g. External application: prepared decoction for washing the affected parts."}
{"N0.":85,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/85Asclepias%20curassavical%20L..jpg?raw=true","Name":["馬利筋","Blood-flower","Asclepias curassavical L."],"familyGenus":"Asclepiadaceae, Asclepias","partUsed":"entire plant","harvestProcessing":"Collected all over the year, sun-dried or used fresh.","propertiesActions":"Bitter, cold. Toxic.Clearing heat, detoxifying, activating blood circulation, arresting bleeding, dispersing swelling and relieving pain.","indicationsUsage":"Swelling and pain in throat, cough with lung heat, pyretic stranguria, irregular menstrual periods, metrorrhagia and metrostaxis, leukorrhea, anthracia and swelling caused by toxicity, eczema, refractory tinea, hemorrhage caused by trauma.Internal: decocting, 6-9g. External: fresh herb appropriate amount, triturated for application, or dried herb stir-heated and powdered for application. Not use for physically-weak person."}
{"N0.":86,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/86Melastoma%20sanguineum%20Sims.jpg?raw=true","Name":["毛稔","Blood-red Melastoma","Melastoma sanguineum Sims"],"familyGenus":"Melastomataceae, Melastoma","partUsed":"leaves, whole plant and roots","harvestProcessing":"Leaves or whole plant: harvested in summer and used fresh. Roots: excavated in winter, washed, sliced, and sun-dried.","propertiesActions":"Leaf or whole plant: bitter, harsh, cool. Root: little bitter, harsh, neutral.Leaves or whole plant: detoxifying and suppressing pains, engendering flesh and relieving hemorrhage. Roots: dispersing food, relieving diarrhea, detumescence and relieving hemorrhage.","indicationsUsage":"Leaves or whole grass: hernia and abdominal pain, dysentery, hemafecia, hypermenorrhea, swelling pain from fall, traumatic hemorrhage. Root: watery diarrhea, dysentery, Rheumatic arthralgia, hemafecia, metrorrhagia and metrostaxis, swelling pain from fall, traumatic hemorrhage.Leaves or whole plant: oral administration: decocting, 10-15g. External application: appropriate amount, smashed or powdered for applying. Roots: oral administration: decocting, 15-30g. External application: appropriate amount, decocted for washing or powdered for applying."}
{"N0.":87,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/87Selaginella%20uncinata%20(Desv.)%20Spring.jpg?raw=true","Name":["翠雲草","Blue Selaginella","Selaginella uncinata (Desv.) Spring"],"familyGenus":"Selaginellaceae, Selaginella","partUsed":"entire plant","harvestProcessing":"Collected throughout the year, well washed, used fresh or sundried.","propertiesActions":"Tasteless, little bitter, cool.Clearing heat, inducing urination, detoxifying and arresting bleeding.","indicationsUsage":"Jaundice, dysentery, diarrhea, edema, stramgutia, paralysis and pain in bones and muscles, hematemesis, coughing up blood, hemafecia, hemorrhage caused by trauma, prolapse of hemorrhoids, scalding and burns, snake bites.Oral administration: decocting, 10-30g, fresh herb up to 60g. External application: appropriate amount, sundried or directly burned preserving nature of the herb and powdered for application; or fresh herb triturated for application."}
{"N0.":88,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/88Thlaspi%20arvense%20L..jpg?raw=true","Name":["菥蓂","Boor’s Mustard","Thlaspi arvense L."],"familyGenus":"Brassicaceae, Thlaspi","partUsed":"whole plant and seeds","harvestProcessing":"Whole plant: harvested from May to June when fruits mature, and sun-dried. Seeds: collected the whole plant when fruits mature, knocked down seeds, sundried and well threshed.","propertiesActions":"Whole plant: bitter, sweet; little cold. Seeds: pungent; little warm.Whole plant: clearing heat-toxin and disinhibiting diuresis for detumescence. Seeds: improving eyesight and dispelling wind-dampness.","indicationsUsage":"Whole herb: Mainly indicated for swelling pain induced by conjunctival congestion, pulmonary abscess, acute appendicitis, diarrhea, dysentery, leucorrhea, postpartum abdominal pain due to blood stasis, dyspepsia, edema due to nephritis, abdominal dropsy due to cirrhosis, anthracia and swelling toxicity. Seeds: Mainly indicated for swelling pain induced by conjunctival congestion, cataract, nephelium and ulcer polyp, dacryorrhea due to head wind, rheumatic arthralgia.Whole plant: oral administration: decocting, 10-30g, fresh products double in amount. Seeds: oral administration: decocting, 5-15g."}
{"N0.":89,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/89Ficus%20religiosa%20L..jpg?raw=true","Name":["菩提樹","Botree Fig","Ficus religiosa L."],"familyGenus":"Moraceae, Ficus","partUsed":"bark","harvestProcessing":"Can be harvested throughout the year, used fresh or sundried.","propertiesActions":"Suppressing pain and securing teeth.","indicationsUsage":"Toothache, loose teeth."}
{"N0.":90,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/90Equisetum%20arvense%20L..jpg?raw=true","Name":["問荊","Bottle Brush","Equisetum arvense L."],"familyGenus":"Equisetaceae, Equisetum","partUsed":"whole plant","harvestProcessing":"Harvested in summer and autumn, sliced whole plant, put in ventilated place and dried in the shade, or used fresh.","propertiesActions":"Sweet, bitter, neutral.Hemostasis, disinhibiting urine and improving eyesight.","indicationsUsage":"Epistaxis, hematemesis, empsyxis, hemafecia, metrorrhagia and metrostaxis, traumatic hemorrhage, stranguria, conjunctivitis and pterygium.Oral administration: decocting, 3-15g. External application: appropriate amount, fresh products smashed for applying; or dried products powdered for dusting."}
{"N0.":91,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/91Lagenaria%20siceraria%20(Molina)%20Standl.%20Var%20depressa%20(Ser.)%20Hara.jpg?raw=true","Name":["瓠瓜","Bottle Gourd","Lagenaria siceraria (Molina) Standl. Var depressa (Ser.) Hara"],"familyGenus":"Cucurbitaceae, Lagenaria","partUsed":"fruits, seeds, stems, leaves, flowers, fibril, fruit shuck or fully mature fruit shuck.","harvestProcessing":"Fruits: picked mature but still not lignified fruits, and removed pericarp. Seeds: harvested mature fruits in autumn; taken out seeds, washed, and sun-dried. Shuck: picked fully mature fruits in late autumn and early winter, cut open, removed pulp and seeds, smashed, and sun-dried. Stems, leaves, flowers and fibrils: harvested in summer and autumn and sun-dried.","propertiesActions":"Fruits: sweet, tasteless, neutral. Seeds: sweet, neutral. Fruit shell: sweet, bitter, neutral. Stem, leaf, flower, root hair: sweet, neutral.Fruits: disinhibiting diuresis, detumescence, relieving strangury, dissipating binds. Seeds: clearing heat-toxin, detumescence for suppressing pains. Fruit shuck: disinhibiting diuresis, detumescence. Stem, leaves, flowers and fibril: detoxicating and dissipating binds.","indicationsUsage":"Fruits: used for edema, abdominal dropsy, jaundice, diabetes, stramgutia, anthracia. Seeds: used for pneumonia, acute appendicitis, toothache. Fruit shell: used for edema, distention. Stem, leaves, flowers and fibrous roots: used for food, drug poisoning, pain caused by dental caries, fistulae, dysentery.Fruits: oral administration: decocting, 9-30g; or calcined preserving nature and powdered. Seeds: oral administration: decocting, 9-15g. Fruit shuck: oral administration: decocting, 10-30g; or burnt preserving nature and powdered. External application: appropriate amount, burnt preserving nature and powdered for applying. Stem, leaves, flowers or fibril: oral administration: decocting, 6-30g; or calcined preserving nature and powdered."}
{"N0.":92,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/92Delphinium%20grandiflorum%20L..jpg?raw=true","Name":["大花飛燕草","Bouquet Larkspur","Ranunculaceae, Delphinium"],"familyGenus":"Ranunculaceae, Delphinium","partUsed":"roots or whole plant","harvestProcessing":"Harvested in autumn and winter root tuber, wash out earth, cut off fibril, sliced, and sun-dried. Whole plant harvested in July-August, chopped into segments, and sun-dried.","propertiesActions":"Bitter, cold, toxic.Dispelling pathogenic wind and removing dampness, suppressing pains, destroying parasites for suppressing itching.","indicationsUsage":"Anemogenous toothache, rheumatic arthralgia, scabies and ringworm.External application: appropriate amount, decocted for rinsing; or smashed to extract juice for washing; or powdered for application after mixed with water. Toxic, not for oral administration."}
{"N0.":93,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/93Salvia%20bowleyana%20Dunn.jpg?raw=true","Name":["南丹參","Bowley Sage","Salvia bowleyana Dunn"],"familyGenus":"Lamiaceae, Salvia","partUsed":"roots","harvestProcessing":"Excavated in autumn, removed stem leaves and fibril, well washed, and sun-dried.","propertiesActions":"Taste bitter, little cold in nature.Promoting blood circulation and eliminating stasis, regulating menstruation and suppressing pains.","indicationsUsage":"Used for thoracic obstruction and angina, upset, palpitation, pain in gastric cavity and abdomen, irregular menstrual periods, algomenorrhea, menostasia, postpartum abdominal pain due to blood stasis, metrorrhagia and metrostaxis, splenohepatomegaly, arthralgia, hernia pain, swelling sores.Oral administration: decocting, 9-15g; or made as pills or powders."}
{"N0.":94,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/94Pteridium%20aquilinum%20(L.)%20Kuhn%20var.latiusculum%20(Desv.)%20Underw..jpg?raw=true","Name":["蕨","Bracken Fern","Pteridium aquilinum (L.) Kuhn var.latiusculum (Desv.) Underw."],"familyGenus":"Pteridiaceae, Pteridium","partUsed":"young leaves and roots","harvestProcessing":"Tender leaves: picked in autumn and winter, sun-dried or used fresh. Roots: excavated in autumn and winter, washed, and sun-dried.","propertiesActions":"Tender leaves: sweet, cold. Root: sweet, cold, toxic.Young leaves: clearing heat for inducing diuresis, downbearing qi-flow dissipating phlegm and relieving hemorrhage. Roots: clearing heat for inducing diuresis, suppressing hyperactive liver and calming mental state, removing toxin for detumescence.","indicationsUsage":"Tender leaves: cold and pyrexia, jaundice, dysentery, leukorrhea, achalasia of cardia, empsyxis due to pulmonary tuberculosis, rheumatic arthralgia. Root: pyrexia, swelling pain in the throat, diarrhea, dysentery, jaundice, leucorrhea, hypertension, dizziness and insomnia, rheumatic arthralgia, hemorrhoids, anal prolapse, eczema, scalding injuries, bites by snakes and insects.Young leaves: oral administration: decocting, 9-15g. External application: appropriate amount, smashed for applying; or powdered for dusting. Not take raw or for long. Use with caution in cases of deficient-cold in spleen and stomach or with scabies. Roots: oral administration: decocting, 9-15g. External application: appropriate amount, powdered or grilled and applied after mixed with fluid. Not take for long and too much."}
{"N0.":95,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/95Chlorophytium%20comosum%20(Thunb.)%20Baker.jpg?raw=true","Name":["吊蘭","Bracket Plant","Chlorophytium comosum (Thunb.) Baker"],"familyGenus":"Liliaceae, Chlorophytum","partUsed":"whole plant","harvestProcessing":"Can be harvested throughout the year, well washed and used fresh.","propertiesActions":"Bitter, cold.Reduce phlegm, suppressing cough, clearing heat and resolving toxin.","indicationsUsage":"Cough with lung heat, injuries caused by falls, fractures, anthracia, hemorrhoids, burns.Oral administration: decocting, 6-15g, fresh products 15-30g. External application: appropriate amount, smashed for application; or decocted for washing."}
{"N0.":96,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/96Vicia%20faba%20L..jpg?raw=true","Name":["蠶豆","Broad bean","Vicia faba L."],"familyGenus":"Fabaceae, Vicia","partUsed":"seeds","harvestProcessing":"Pulled up whole plant in summer when fruits turn black brown, sundried, knocked down seeds, threshed, and sun-dried. Or used when fresh.","propertiesActions":"Sweet, little pungent, neutral.Invigorating spleen for diuresis, removing toxin for detumescence.","indicationsUsage":"Used for bloated feeling in the chest with difficulty in swallowing, edema.Oral administration: decocting or powdered. External application: smashed for applying."}
{"N0.":97,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/97Typha%20latifolia%20L..jpg?raw=true","Name":["寬葉香蒲","Broadleaf Cattai","Typha latifolia L."],"familyGenus":"Typhaceae, Typha","partUsed":"pollen","harvestProcessing":"In the second year of planting, flowers and production would increase; collected on sunny days in June-July of flowering when pollen of staminate flower mature, pinched off staminate flower by hands, sun-dried and grated, sieved away impurities.","propertiesActions":"Sweet, pungent, neutral.Relieving hemorrhage, dispelling stasis and disinhibiting urine.","indicationsUsage":"Hematemesis, empsyxis, non-traumatic hemorrhage, hematodiarrhoea, hemafecia, metrorrhagia and metrostaxis, traumatic hemorrhage, cardiac and abdomen pain, amenorrhea and stomachache, postpartum pain due to blood stasis, algomenorrhea, swelling pains caused by falls, difficulty and pain in micturition induced by bloody stranguria, leukorrhea, congenital deformity of the tongue, sore mouth, impaction of cerumen, damp itching in the private parts.Oral administration: decocting, 5-10g, herb wrapped during decocting; or made as pills or powders. External application: appropriate amount, powdered for dusting or applied after mixed with fluid. Use with caution in cases of pregnancies."}
{"N0.":98,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/98Echinops%20latifolius%20Tausch..jpg?raw=true","Name":["驢欺口","Broadleaf Globethistle","Echinops latifolius Tausch."],"familyGenus":"Asteraceae, Echinops","partUsed":"root","harvestProcessing":"Harvested in spring and autumn. Removed fibrous root, well-washed, and dried.","propertiesActions":"Bitter, cold.Clearing heat and removing toxin, resolving carbuncle, promoting lactation, relaxing sinew and promoting blood circulation.","indicationsUsage":"Used for mammary abscess, carbuncles on back, scrofula, failure of lactation, arthralgia due to dampness."}
{"N0.":99,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/99Liriope%20platyphylla%20Wang%20et%20Ts.%20Tang.jpg?raw=true","Name":["闊葉山麥冬","Broadleaf Liriope","Liriope platyphylla Wang et Ts. Tang"],"familyGenus":"Liliaceae, Liriope","partUsed":"tuber","harvestProcessing":"Excavated at the Beginning of summer or before Pure Brightness, cut off root tuber, washed, and sun-dried.","propertiesActions":"Sweet, little bitter, little cold.Nourishing yin and engendering liquid.","indicationsUsage":"Yin asthenia causing pulmonary dryness, cough with sticky phlegm, insufficiency of fluids in stomach, dry mouth and pharynx, constipation induced by dryness of the intestine.Oral administration: decocting, 10-15g."}
{"N0.":100,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/100Sedum%20lineare%20Thunb..jpg?raw=true","Name":["佛甲草","Buddhanail","Sedum lineare Thunb."],"familyGenus":"Crassulaceae, Sedum","partUsed":"stem and leaves","harvestProcessing":"Collected any time for fresh use; or in summer and autumn, harvest the entire plant, well washed, heated in boiling water, drag out, sun-dried or baked to dry.","propertiesActions":"Sweet, tasteless, cold.Clearing heat, detoxifying, inducing urination and arresting blood.","indicationsUsage":"Swelling pain in throat, swelling pain induced by conjunctival congestion, toxic heat and ulcerative carbuncle, furunculosis, erysipelas, erysipelas, scalding and burns, venomous snake bites, jaundice, hygropyretic diarrhea and dysentery, hemafecia, metrorrhagia and metrostaxis, hemorrhage due to trauma, verruca plana.Oral administration: decocting, 9-15g, fresh herb 20-30g; or extracted juice. External application: appropriate amount, fresh herb triturated for application; or extracted juice for gargling or eye-dripping."}
{"N0.":101,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/101Bauhinia%20variegate%20L..jpg?raw=true","Name":["紅花羊蹄甲","Buddhist Bauhinia","Bauhinia variegate L."],"familyGenus":"Fabaceae, Bauhinia","partUsed":"roots, bark, leaves and flowers","harvestProcessing":"Roots: collected all over the year, well washed, sliced and sun-dried. Bark: collected all over the year, cut off bark, sliced, used fresh or sun-dried. Leaves: collected in summer and autumn, used fresh or sundried. Flower: collected in spring and summer when flowering, baked to dry.","propertiesActions":"Root: bitter, harsh, neutral. Bark: bitter, harsh, neutral. Leaves: tasteless, cool. Flower: tasteless, cool.Root: fortifying spleen, removing damp and arresting bleeding. Bark: fortifying spleen, removing damp. Leaf: stopping cough, clearing phlegm and relaxing bowels. Flower: clearing heat, detoxifying and checking cough.","indicationsUsage":"Root: dyspepsia, acute gastroenteritis, hepatitis, cough and empsyxis, arthralgia, injuries from falls. Bark: dyspepsia, vomiting, diarrhea. Leaves: cough, bronchitis, constipation, Flower: pneumonia, trachitis, empsyxis due to pulmonary tuberculosis, hepatitis.Root: oral administration: decocting, 10-30g. Bark: oral administration: decocting, 10-30g. Leaf: oral administration: decocting, 10-15g. Flower: oral administration: decocting, 9-15g."}
{"N0.":102,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/102Podocarpus%20macrophyllus%20(Thunb.ex%20Murray)%20D.%20Don.jpg?raw=true","Name":["羅漢松","Buddhist Pine","Podocarpus macrophyllus (Thunb.ex Murray) D. Don"],"familyGenus":"Podocarpaceae, Podocarpus","partUsed":"velamen, seeds and receptacle, branches and leaves","harvestProcessing":"Velamen: excavated in autumn or throughout the year, washed, used fresh or sundried. Seeds and receptacle: picked stems with receptacle when seeds mature in autumn, and sun-dried. Branches and leaves: harvested in summer and autumn or throughout the year, washed, used fresh or sundried.","propertiesActions":"Root peel: sweet, little bitter, little warm. Seed and receptacle: sweet, little warm. Branches and leaves: tasteless, neutral.Root coat: promoting blood circulation for dispelling stasis, dispelling wind-dampness, killing warms and stopping itching. Seeds and receptacle: promoting qi-flowing for suppressing pains, warming the middle jiao for replenishing the blood. Branches and leaves: relieving hemorrhage.","indicationsUsage":"Root peel: injuries from falls, rheumatic arthralgia, ringworm. Seeds and torus: pain of gastric cavity, etiolate due to hemopenia. Branches and leaves: hematemesis, coughing up blood.Root coats: oral administration: decocting, 9-15g. External application: appropriate amount, smashed for applying; or decocted for fumigating and washing. Seeds and receptacle: oral administration: decocting, 10-20g. Branches and leaves: oral administration: decocting, 10-30g."}
{"N0.":103,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/103Buddleja%20lindleyana%20Fort..jpg?raw=true","Name":["醉魚草","Buddleja","Buddleja lindleyana Fort."],"familyGenus":"Loganiaceae, Buddleja","partUsed":"Rhizome","harvestProcessing":"Collected in summer and autumn, cut up, sun-dried or used fresh.","propertiesActions":"Pungent; bitter; warm in nature; toxic.Removing wind, detoxifying, expelling parasites and benefiting bones.","indicationsUsage":"Mumps, anthracia, scrofula, ascariasis, uncinariasis, fishbone caught in throat.Internal: decocting, 10-15g, fresh used 15-30g; or extracted juice. External: appropriate amount, ground for application."}
{"N0.":104,"Img":"https://github.com/SunnyRichman/2024_IR_Project/blob/main/resources/104Polygonum%20viviparum%20L..jpg?raw=true","Name":["珠芽蓼","Bulbil Knotweed","Polygonum viviparum L."],"familyGenus":"Polygonaceae, Polygonum","partUsed":"rhizome","harvestProcessing":"Excavated in autumn rhizome, removed fibrous roots and impurities, washed, air-dried and sliced for future use.","propertiesActions":"Bitter, harsh, cool.Relieving hemorrhage, promoting blood circulation and relieving diarrhea.","indicationsUsage":"Used for hematemesis, non-traumatic hemorrhage, profuse uterine bleeding, leucorrhea, dysentery, injuries from falls.Oral administration: decocting, 9-15g; or made as medicinal liquor. External application: powdered for dusting."}
